includes/solca_7.tex
% Created 2025-12-20 Sat 12:55
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage{fontspec}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{graphicx}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{tcolorbox}
\usepackage{geometry}
\usepackage{fancyhdr}
\usepackage{minted}
\author{Digital Nomad}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Digital Nomad},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Solution de l'exercice 15}
\label{sec:orgacfcdbf}

Pour chacune des situations suivantes, indiquons comment la
résoudre selon la représentation vectorielle parmi :

\begin{itemize}
\item Analytique (coordonnées, calculs algébriques)
\item Colinéarité (proportionnalité, déterminant)
\item Géométrique (relation de Chasles, parallélogramme)
\end{itemize}


\begin{enumerate}
\item Démontrer que les points A, B, C sont alignés.
\begin{itemize}
\item Analytique : à l'aide des coordonnées de chaque point on peut
calculer les coordonnées des vecteurs \(\overrightarrow{AB}\)
et \(\overrightarrow{AC}\) et vérifier si les vecteurs sont
colinéaires ou pas.
\item Colinéarité : à l'aide des coordonnées ou de la décomposition
de Chasles on peut calculer le déterminant ou établir une
relation du type \(\overrightarrow{AB} =
         k\overrightarrow{AC}\) si les vecteurs sont colinéaires.
\item Géométrique : la relation de Chasles nous permet d'établie si
la relation \(\overrightarrow{AB} = k\overrightarrow{AC}\)
existe ou pas
\end{itemize}
\item Calculer la distance entre deux points A(2;3) et B(5;7)
\begin{itemize}
\item Analytique : on applique la formule (qui découle de
Pythagore)
\item Colinéarité : pour ce type de problème la colinéarité est
inutile
\item Géométrique : pour ce type de problème ni Chasles ni les
identités du parallélogramme ne peuvent servir
\end{itemize}
\item Montrer que ABCD est un parallélogramme
\begin{itemize}
\item Analytique : à l'aide des coordonnées on peut vérifier si on
a l'égalité vectorielle
\[\overrightarrow{AB} = \overrightarrow{DC}\]
ou pas.
\item Colinéarité : à l'aide des coordonnées ou de la relation de
Chasles on peut vérifier si on a l'égalité vectorielle
\[\overrightarrow{AB} = \overrightarrow{DC}\]
ou pas. On peut également calculer les deux déterminants
importants
\[det(\overrightarrow{AB} , \overrightarrow{DC})\quad
         det(\overrightarrow{AD} , \overrightarrow{BC})\]
\item Géométrique : en utilisant Chasles on peut vérifier si on
obtient la relation
\[\overrightarrow{AB} + \overrightarrow{AD} = \overrightarrow{AC}\]
\end{itemize}
\item Trouver les coordonnées du point M tel que :
\[\overrightarrow{AM} = 2\overrightarrow{AB} +
       3\overrightarrow{AC}\]
\begin{itemize}
\item Analytique : on calcule les coordonnées des vecteurs \(\overrightarrow{AB}\)
et \(\overrightarrow{AC}\) et on résout les deux équations
pour obtenir les coordonnées du points M(x ; y).
Concrètement :
\begin{align*}
x - x_A &= 2(x_B - x_A) + 3(x_C - x_A)\\
y - y_A &= 2(y_B - y_A) + 3(y_C - y_A)\\
x &= -4x_A + 2x_B + 3x_C\\
y &= -4y_A + 2y_B + 3y_C
\end{align*}
\item Colinéarité : on ne peut pas obtenir les coordonnées du point
M uniquement avec le déterminant.
\item Géométrique : on peut construire le point M grâce à la
relation vectorielle puis en utilisant Chasles on peut
exprimer le vecteur \(\overrightarrow{OM}\) en fonction des
vecteurs \(\overrightarrow{OA}\), \(\overrightarrow{OB}\) et
\(\overrightarrow{OC}\)
\end{itemize}
\item Vérifier si deux droites (AB) et (CD) sont parallèles
\begin{itemize}
\item Analytique : on peut comparer les coordonnées des vecteurs
\(\overrightarrow{AB}\) et \(\overrightarrow{CD}\)
\item Colinéarité : on peut calculer le déterminant
\(det(\overrightarrow{AB} , \overrightarrow{CD})\) et voir
s'il est nul ou pas
\item Géométrique : on peut vérifier si on obtient une identité du
parallélogramme ou pas
\end{itemize}
\end{enumerate}


\section{Solution du programme}
\label{sec:orgf79081a}

Écrire un programme Python qui résout le problème
\[\overrightarrow{AM} = a\overrightarrow{AB} +
    b\overrightarrow{AC}\]
C'est-à-dire un programme qui permet d'exprimer les coordonnées du
point M en fonction des paramètres a et b et des coordonnées des
points déjà existants A, B, et C.

\begin{minted}[bgcolor=bg,fontsize=\footnotesize,linenos=true]{python}
    def get_M(a, b, A, B, C):
        """
        Cette fonction prend en entrées :
        + a : 1 float correspondant au coefficient du vecteur AB
        + b : 1 float correspondant au coefficient du vecteur AC
        + A : 1 tuple de float correspondant aux coordonnées du point A
        + B : 1 tuple de float correspondant aux coordonnées du point B
        + C : 1 tuple de float correspondant aux coordonnées du point C
        et elle renvoie 1 tuple de float correspondant
        aux coordonnées du point M
        """
        x = (1 - a - b) * A[0] + a * B[0] + b * C[0]
        y = (1 - a - b) * A[1] + a * B[1] + b * C[1]
        return (x, y)


    def vectAB(A, B):
        """
        Cette fonction prend en entrées :
        + A : 1 tuple de float correspondant aux coordonnées du point A
        + B : 1 tuple de float correspondant aux coordonnées du point B
        et renvoie 1 tuple de float correspondant
        aux coordonnées du vecteur AB
        """
        x = B[0] - A[0]
        y = B[1] - A[1]
        return (x, y)


    # Tests
    a, b, A, B, C = 1, 1, (3, 2), (-3, 2), (3, -2)

    M = get_M(a, b, A, B, C)

    relation = f"On a la relation Vect(A, M) = "
    relation += f"{a}Vect(A, B) + {b}Vect(A, C)"

    print(relation)

    input("Pour voir les coordonnées du point M tapez 1\t")

    coordM = f"Voici les coordonnées du point M({M[0]}, {M[1]})"
    print(coordM)

    coordAB = vectAB(A, B)
    coordAC = vectAB(A, B = C)

    eqX = f"x - {A[0]} = {a} * {coordAB[0]} + {b} * {coordAC[0]}"
    input("Pour voir l'équation en x tapez 1\t")
    print(eqX)

    eqY = f"y - {A[1]} = {a} * {coordAB[1]} + {b} * {coordAC[1]}"
    input("Pour voir l'équation en y tapez 1\t")
    print(eqY)

    solve_x = f"x = {A[0] + a * coordAB[0] + b * coordAC[0]}"
    input("Pour voir la solution de l'équation en x tapez 1\t")
    print(solve_x)

    solve_y = f"y = {A[1] + a * coordAB[1] + b * coordAC[1]}"
    input("Pour voir la solution de l'équation en y tapez 1\t")
    print(solve_y)

\end{minted}



\section{Solution du QCM d'auto-évaluation}
\label{sec:org9062c89}

\textbf{Parmi les réponses proposées au moins une est la bonne. Cela
signifie qu'il peut y avoir \emph{plusieurs} bonnes réponses.}

\begin{enumerate}
\item Si ABC est un triangle et que D est un 4ème point qui vérifie
l'égalité \[\overrightarrow{AD} = \overrightarrow{AB} +
       \overrightarrow{AC}\]
alors on peut en déduire que :

\begin{enumerate}
\item \(\overrightarrow{AB} + \overrightarrow{BC} =
          \overrightarrow{AC}\) la relation de Chasles n'est pas une
déduction, elle existe toujours
\item ABCD est un parallélogramme
\item ABDC est un parallélogramme

(\textbf{Bonne réponse})
\item \(\overrightarrow{AB} = \overrightarrow{CD}\) et
\(\overrightarrow{AC} = \overrightarrow{BD}\) les deux
égalités sont vraies

(\textbf{Bonne réponse})
\item \(\overrightarrow{AB} = \overrightarrow{CD}\) ou
\(\overrightarrow{AC} = \overrightarrow{BD}\) une seule des
deux égalités est vraie
\item \(\overrightarrow{AB} \neq \overrightarrow{CD}\) et
\(\overrightarrow{AC} \neq \overrightarrow{BD}\) aucune
des égalités n'est vraie
\item le point D est à l'intérieur du triangle ABC
\item le point D est l'image du point A par la symétrie de
centre le milieu du segment [BC]

(\textbf{Bonne réponse})
\item le point D est à l'extérieur du triangle ABC

(\textbf{Bonne réponse})
\item le point D est l'image du point I par la translation de
vecteur \(\overrightarrow{AI}\) où I est le milieu du
segment [BC]

(\textbf{Bonne réponse})
\end{enumerate}
\item Si ABCD est un carré alors : 

\begin{enumerate}
\item Les vecteurs \(\overrightarrow{AB}\) et
\(\overrightarrow{AC}\) forment une base orthornomée
\item Les vecteurs \(\overrightarrow{AB}\) et
\(\overrightarrow{AD}\) forment une base orthornomée

(\textbf{Bonne réponse})
\item \(det(\overrightarrow{AB} , \overrightarrow{AC}) = 1\)
\item \(det(\overrightarrow{AB} , \overrightarrow{AD}) = 0\)
\item \(det(\overrightarrow{AB} , \overrightarrow{AD}) = 1\)
\item \(det(\overrightarrow{AB} , \overrightarrow{AC}) = 0\)
\item \(AC^2 = AB^2 + BC^2\)

(\textbf{Bonne réponse})
\item \(\overrightarrow{AB} + \overrightarrow{CD} =
          2\overrightarrow{AB}\)
\item \(\overrightarrow{AB} + \overrightarrow{CD} = \vec{0}\)

(\textbf{Bonne réponse})
\item Le centre O du carré vérifie
\[\overrightarrow{OA} + \overrightarrow{OB} +
           \overrightarrow{OC} + \overrightarrow{OD} = \vec{0}\]

(\textbf{Bonne réponse})
\end{enumerate}
\item Si ABCD est un rectangle et O l'intersection des droites (AC)
et (BD) alors : 

\begin{enumerate}
\item \(\overrightarrow{OA} + \overrightarrow{OB} +
          \overrightarrow{OB} + \overrightarrow{OD} = \vec{0}\)

(\textbf{Bonne réponse})
\item \(\overrightarrow{AO} = \overrightarrow{OC} =
          \dfrac{1}{2}\overrightarrow{AC}\)

(\textbf{Bonne réponse})
\item \(det(\overrightarrow{AB} , \overrightarrow{AC}) = 1\)
\item \(det(\overrightarrow{AB} , \overrightarrow{AD}) = 0\)
\item \(det(\overrightarrow{AB} , \overrightarrow{AD}) = 1\)
\item \(det(\overrightarrow{AB} , \overrightarrow{AC}) = 0\)
\item \(AC > AB + BC\)
\item \(AC < AB + AD\)

(\textbf{Bonne réponse})
\item \(AC = BD\)

(\textbf{Bonne réponse})
\item \(AC\neq BD\)
\end{enumerate}
\item Soient A et B deux points distincts du plan. Si C est l'image
de B par la translation de vecteur \(\overrightarrow{AB}\)
alors : 	 

\begin{enumerate}
\item \textbf{B est le milieu du segment [AC] (Bonne réponse)}
\item \(\overrightarrow{AC} = 2\overrightarrow{AB}\)
\item \(\overrightarrow{OC} = \overrightarrow{OA} +
          2\overrightarrow{OB}\)
\item les coordonnées de C vérifient :
\begin{align*}
x_C &= 2x_B - x_A\\
y_C &= 2y_B - y_A
\end{align*}
\item \textbf{les coordonnées de C vérifient :}
\begin{align*}
x\textsubscript{C} \&= 2x\textsubscript{B} + x\textsubscript{A}\\[0pt]
y\textsubscript{C} \&= 2y\textsubscript{B} + y\textsubscript{A}
\end{align*} \textbf{(Bonne réponse)}
\item \textbf{C est l'image de A par la symétrie de centre B. (Bonne
réponse)}
\item C est le milieu du segment [AB].
\item \textbf{\(\overrightarrow{AB} = \overrightarrow{BC}\) (Bonne
réponse)}
\item \textbf{\(\overrightarrow{AB} + \overrightarrow{BC} =
          2\overrightarrow{AB}\) (Bonne réponse)}
\item \textbf{\(det(\overrightarrow{AB} , \overrightarrow{AC}) = 0\)
(Bonne réponse)}
\end{enumerate}
\item Si on a \(det(\overrightarrow{AB}, \overrightarrow{AD}) \neq 0\)
et \(det(\overrightarrow{AB}, \overrightarrow{DC}) = 0\) alors :

\begin{enumerate}
\item \textbf{ABCD ou ABDC est un trapèze. (Bonne réponse)}
\item \textbf{Si AB = DC alors ABCD ou ABDC est un
parallélogramme. (Bonne réponse)}
\item \textbf{Si AB = AD = DC alors ABCD est un losange. (Bonne réponse)}
\item \textbf{Si AB = AC = CD alors ABDC est un losange. (Bonne réponse)}
\item Si AB = DC et CA = BD alors ABDC est un rectangle.
\item Si AB = DC et AD = BC alors ABDC est un rectangle.
\item \textbf{Si AB = DC et AC = BD alors ABCD est un rectangle. (Bonne
réponse)}
\item Si AB = DC et AD = BC alors ABCD est un rectangle.
\item Si AB = DC et AC = BD alors ABCD est un losange.
\item \textbf{Si AB = DC et AD = BC alors ABCD est un losange. (Bonne
réponse)}
\end{enumerate}
\item Soient \(\vec{u}\), \(\vec{v}\) et \(\vec{w}\) trois vecteurs
tels que \(\vec{w} = \vec{u} + \vec{v}\).

\begin{enumerate}
\item \textbf{Si \(\lvert\lvert\vec{u}\rvert\rvert + \lvert\lvert\vec{v}\rvert\rvert = \lvert\lvert\vec{w}\rvert\rvert\) alors les trois vecteurs sont colinéaires. (Bonne réponse)}
\item Il est impossible que les trois vecteurs soient colinéaires.
\item \textbf{Si \(det(\vec{u}, \vec{v}) = 0\) alors les trois vecteurs
sont colinéaires. (Bonne réponse)}
\item \textbf{Si \(det(\vec{u}, \vec{v}) = 0\) alors \(det(\vec{v},
          \vec{w}) = 0\). (Bonne réponse)}
\item \textbf{Si \(det(\vec{w}, \vec{u}) = 0\) alors \(det(\vec{u},
          \vec{v}) = 0\). (Bonne réponse)}
\item \(\lvert\lvert\vec{u}\rvert\rvert +
          \lvert\lvert\vec{v}\rvert\rvert >
          \lvert\lvert\vec{w}\rvert\rvert\)
\item \(\lvert\lvert\vec{u}\rvert\rvert +
          \lvert\lvert\vec{v}\rvert\rvert <
          \lvert\lvert\vec{w}\rvert\rvert\)
\item Si \(det(\vec{u}, \vec{v}) = 0\) alors soit \(\vec{u} =
          \vec{0}\) soit \(\vec{v} = \vec{0}\)
\item Si \(det(\vec{u}, \vec{v}) = 0\) alors soit \(\vec{w} =
          \vec{u}\) soit \(\vec{w} = \vec{v}\)
\item Si \(det(\vec{w}, \vec{u}) = 0\) alors soit \(\vec{u} =
          -\vec{v}\) soit \(\vec{w} = \vec{0}\)
\end{enumerate}
\item Soit un vecteur \(\vec{u}\) de norme
\(\lvert\lvert\vec{u}\rvert\rvert = 5\).

\begin{enumerate}
\item Si \(x_{\vec{u}} = 3\) alors \(y_{\vec{u}} = 4\).
\item Si \(x_{\vec{u}} = 3\) alors \(y_{\vec{u}} = -4\).
\item Si \(x_{\vec{u}} = -3\) alors \(y_{\vec{u}} = -4\).
\item Si \(x_{\vec{u}} = -3\) alors \(y_{\vec{u}} = 4\).
\item \textbf{Si \(x_{\vec{u}} = \pm 3\) alors \(y_{\vec{u}} = \pm 4\). (Bonne réponse)}
\item Si \(x_{\vec{u}} = -4\) alors \(y_{\vec{u}} = 3\).
\item Si \(x_{\vec{u}} = -4\) alors \(y_{\vec{u}} = -3\).
\item Si \(x_{\vec{u}} = 4\) alors \(y_{\vec{u}} = -3\).
\item Si \(x_{\vec{u}} = 4\) alors \(y_{\vec{u}} = 3\).
\item \textbf{Si \(x_{\vec{u}} = \pm 4\) alors \(y_{\vec{u}} = \pm 3\). (Bonne réponse)}
\end{enumerate}
\item Dans un repère orthonormée \((O ; \vec{i} , \vec{j})\) on
considère les points A(3 ; 2), B(3 ; -2), C(-3 ; -2), D(3 ;
-1), E(-3 ; -1), F(-1 ; -1), G(1 ; 1), H(1 ; 2), I(-1 ; 2).       

\begin{enumerate}
\item Les vecteurs \(\overrightarrow{AB}\) et
\(\overrightarrow{AC}\) sont colinéaires car
\[det(\overrightarrow{AB} , \overrightarrow{AC}) = 0\]
\item Les vecteurs \(\overrightarrow{AH}\) et
\(\overrightarrow{AI}\) sont colinéaires car
\[det(\overrightarrow{AH} , \overrightarrow{AI}) = 0\]
\item Les points A, B et C sont alignés.
\item \textbf{Les points D, E et F sont alignés. (Bonne réponse)}
\item \textbf{ABC est un triangle rectangle en B. (Bonne réponse)}
\item ABD est un triangle rectangle en B.
\item \textbf{GDF est un triangle rectangle en G. (Bonne réponse)}
\item \textbf{GDF est un triangle isocèle en G. (Bonne réponse)}
\item \textbf{BCHA est un trapèze. (Bonne réponse)}
\item \textbf{Les vecteurs \(\overrightarrow{BC}\) et
\(\overrightarrow{AH}\) sont colinéaires. (Bonne réponse)}
\end{enumerate}
\item Dans un repère orthonormée \((O ; \vec{i} , \vec{j})\) on
considère les points A(2 ; 3), B(-3 ; 2), C(-2 ; -3); D(3 ;
-2).

\begin{enumerate}
\item Le triangle BOA est isocèle en A.
\item Le triangle BOA est isocèle en B.
\item \textbf{Le triangle BOA est isocèle en O. (Bonne réponse)}
\item Le triangle BOA est rectangle en A.
\item Le triangle BOA est rectangle en B.
\item \textbf{Le triangle BOA est rectangle en O. (Bonne réponse)}
\item \textbf{C est l'image de O par la translation de vecteur
\(\overrightarrow{AO}\). (Bonne réponse)}
\item \textbf{D est l'image de O par la translation de vecteur
\(\overrightarrow{BO}\). (Bonne réponse)}
\item ABDC est un carré.
\item \textbf{ABCD est un carré. (Bonne réponse)}
\end{enumerate}
\end{enumerate}
\end{document}
